{ pkgs, lib, ... }:
{
  snacks = {
    enable = true;
    settings = {
      dashboard = {
        enable = true;

        preset = {
          header.__raw = ''[[
░███    ░██                                  ░██               
░████   ░██                                                    
░██░██  ░██  ░███████   ░███████  ░██    ░██ ░██░█████████████ 
░██ ░██ ░██ ░██    ░██ ░██    ░██ ░██    ░██ ░██░██   ░██   ░██
░██  ░██░██ ░█████████ ░██    ░██  ░██  ░██  ░██░██   ░██   ░██
░██   ░████ ░██        ░██    ░██   ░██░██   ░██░██   ░██   ░██
░██    ░███  ░███████   ░███████     ░███    ░██░██   ░██   ░██
          ]]'';
        };

        sections = [
          { section = "header"; }
          { section = "keys"; gap = 1; padding = 1; }
          {
            section = "terminal";
            cmd = lib.mkIf (builtins.hasAttr "res" pkgs) "cat ${pkgs.res}/res/header.ansi; sleep .1";
            pane = 2;
            indent = 2;
            height = 30;
            width = 60;
          }
        ];
      };
    };
  };
}
