-- stylua: ignore start
local header = [[
░███    ░██                                  ░██               
░████   ░██                                                    
░██░██  ░██  ░███████   ░███████  ░██    ░██ ░██░█████████████
░██ ░██ ░██ ░██    ░██ ░██    ░██ ░██    ░██ ░██░██   ░██   ░██
░██  ░██░██ ░█████████ ░██    ░██  ░██  ░██  ░██░██   ░██   ░██
░██   ░████ ░██        ░██    ░██   ░██░██   ░██░██   ░██   ░██
░██    ░███  ░███████   ░███████     ░███    ░██░██   ░██   ░██
]]
-- stylua: ignore end

require("snacks").setup({
    dashboard = {
        enable = true,
        preset = {
            header = header
        },
        sections = {
            { section = "header" },
            { gap = 1, padding = 1, section = "keys" },
            {
                cmd = "cat " .. vim.env.HEADER_PATH .. "; sleep .1",
                -- cmd = "cat /nix/store/3sy5wiyk7c4zggf7md9r6vi6ikvn0cwi-resources/res/header.ansi; sleep .1",
                height = 30,
                indent = 2,
                pane = 2,
                section = "terminal",
                width = 60,
            },
        },
    },
})
